## Pandas Practice Notebook

In [177]:
import pandas as pd

In [178]:
series = pd.Series(['Hunda', 'Toyota', 'Ford', 'BMW', 'Benz', 'Fiat'])

In [179]:
series

0     Hunda
1    Toyota
2      Ford
3       BMW
4      Benz
5      Fiat
dtype: object

In [180]:
colors = pd.Series(['Red', 'Blue', 'Green', 'Yellow', 'Emerald', 'Teal'])

In [181]:
colors

0        Red
1       Blue
2      Green
3     Yellow
4    Emerald
5       Teal
dtype: object

In [182]:
car_data = pd.DataFrame({
    'car_make': series,
    'color': colors
})

In [183]:
car_data

  car_make    color
0    Hunda      Red
1   Toyota     Blue
2     Ford    Green
3      BMW   Yellow
4     Benz  Emerald
5     Fiat     Teal

In [184]:
car_sales = pd.read_csv('./car-sales.csv')

In [185]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [186]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [187]:
car_sales.Price = [float(x.replace('$', '').replace(',', '')) for x in car_sales.Price]

In [188]:
car_sales.dtypes

Make              object
Colour            object
Odometer (KM)      int64
Doors              int64
Price            float64
dtype: object

In [189]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [190]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [191]:
car_sales.describe()

       Odometer (KM)      Doors         Price
count      10.000000  10.000000     10.000000
mean    78601.400000   4.000000   7645.000000
std     61983.471735   0.471405   5379.407753
min     11179.000000   3.000000   3500.000000
25%     35836.250000   4.000000   4625.000000
50%     57369.000000   4.000000   6625.000000
75%     96384.500000   4.000000   7375.000000
max    213095.000000   5.000000  22000.000000

In [192]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

In [193]:
car_sales

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   4000.0
1   Honda    Red          87899      4   5000.0
2  Toyota   Blue          32549      3   7000.0
3     BMW  Black          11179      5  22000.0
4  Nissan  White         213095      4   3500.0
5  Toyota  Green          99213      4   4500.0
6   Honda   Blue          45698      4   7500.0
7   Honda   Blue          54738      4   7000.0
8  Toyota  White          60000      4   6250.0
9  Nissan  White          31600      4   9700.0

In [195]:
car_sales['Price'].mean()

7645.0

In [196]:
car_sales['Price'].sum()

76450.0